study_programs = {
    "הנדסה וניהול": "66",
    "הנדסה מכנית": "30",
    "הנדסה מכנית ומדעי מחשב": "31",
    "הנדסה רפואית": "50",
    "הנדסה רפואית ומדעי מחשב": "51",
    "הנדסת אנרגיה": "62",
    "הנדסת אנרגיה והספק": "67",
    "הנדסת חשמל": "20",
    "הנדסת חשמל ומדעי מחשב": "21",
    "הנדסת מערכות": "61",
    "הנדסת תוכנה": "10",
    "הנדסת תעשייה וניהול": "40",
    "הנדסת תעשייה וניהול ומדעי מחשב": "41",
    "מדעי המחשב": "11",
    "מדעי הנתונים": "19",
    "מערכות תבוניות": "65",
    "חוג כללי": "0"
}


specialization = {
    "התמחות תקשורת":  "21",
    "התמחות מערכות הספק ואנרגיה והינע חשמלי":  "23",
    "התמחות עיבוד אותות,עיבוד תמונה ווידאו":  "24",
    "התמחות מחשבים":  "208",
}

