study_programs = {
    "הנדסה מכנית": "30",
    "הנדסה רפואית": "50",
    "הנדסת חשמל": "20",
    "הנדסת תוכנה": "10",
    "הנדסת תעשייה וניהול": "40",
    "מדעי המחשב": "11",
    "מדעי הנתונים": "19"
}


specialization_electricity = {
    "התמחות תקשורת":  "21",
    "התמחות מערכות הספק ואנרגיה והינע חשמלי":  "23",
    "התמחות עיבוד אותות,עיבוד תמונה ווידאו":  "24",
    "התמחות מחשבים":  "208",
}

specialization_mechanic = {
    "התמחות זרימה ואנרגיה":  "31",
    "התמחות מכניקת המוצק":  "37",
    "התמחות מכטרוניקה ורובוטיקה":  "39",
    "התמחות מערכות רכב":  "302",
    "התמחות חומרים":  "303"
}

specialization_medicine = {
    "התמחות מערכות מידע רפואיות":  "53",
    "התמחות מכניקה של מערכות פיזיולוגיות":  "54"
}

specialization_tiol = {
    "התמחות ראשית מערכות מידע ותעשייה חכמה":  "47",
    "התמחות ראשית ניהול מערכות וקבלת החלטות":  "48",
    "התמחות ראש' אנליטיקה עסקית וניתוח נתונים":  "49",
    "התמחות משנית מערכות מידע ותעשייה חכמה":  "407",
    "התמחות משנית ניהול מערכות וקבלת החלטות":  "408",
    "התמחות מש' אנליטיקה עסקית וניתוח נתונים":  "409"
}

specialization_Software = {
    "התמחות טכנולוגיות תוכנה ומידע":  "13",
    "התמחות תוכנה למערכות ניידות":  "16",
    "התמחות סייבר":  "17",
    "התמחות למידת מכונה ובינה מלאכותית":  "18"
}


last_index = 838


